export default {
    language: { 
        name: 'Беларуская (BE)'
    },
    main_fragment: {
        dashboard: 'Статус',
        basic: 'Асноўная інфармацыя',
        settings: 'Налады'
    },
    dashboard: {
        root_impl: 'Крыніца рут',
        zygote_monitor: 'Маніторынг Zygote',
        zygisk_module_title: 'Няма модуляў Zygisk | Модуль Zygisk ({0}) | Модулі Zygisk ({0})',
        zn_module_title: 'Няма модуляў ZN | Модуль ZN ({0}) | Модулі ZN ({0})',
        root_impl_normal: 'Бягучы крыніца рут - {impl}, denylist будзе працаваць правільна.',
        root_impl_abnormal: 'Не ўдалося вызначыць крыніцу рут, denylist не будзе працаваць.',
        root_impl_multiple: 'Выяўлена некалькі крыніц рут, denylist не будзе працаваць.',
        kernelsu_denylist: 'Denylist ў KernelSU прымяняецца да прыкладанняў для якіх ўключана опцыя \'Размантаваць модулі\' ў App Profile.',
        magisk_denylist: 'Denylist ў Magisk прымяняецца да убудаванаму ў Magisk\'s denylist.',
        apatch_denylist: 'Denylist ў APatch прымяняецца да прыкладанняў якія адзначаны на ўкладцы SuperUser опцыяй \'Выключыць\'',
    },
    settings: {
        log_to_kernel: 'Логі ў dmesg (толькі для распрацоўшчыкаў)',
        nonroot_as_denylist: 'Разглядаць прыкладанні без root як спіс адмоў',
        enforce_denylist: 'Палітыка Denylist',
        enforce_denylist_desc: 'Прымусова: любыя змены для дадаткаў у спісе забароненых будуць адменены.<br/>Толькі размантаванне: будуць адмененыя змены для прыкладанняў з denylist.',
        enforce_denylist_alert: 'Для звычайных карыстальнікаў настойліва рэкамендуецца ўручную адключыць функцыю размантавання ядра ў дыспетчары KernelSU, каб пазбегнуць шматразовага размантавання кропак мантавання з-за няправі',
        denylist_disabled: 'Адключаны',
        denylist_enforced: 'Прымусова',
        denylist_just_umount: 'Толькі размантаванне',
        anonymous_memory: 'Выкарыстоўваць ананімную памяць',
        anonymous_memory_desc: 'Загрузка модуляў у ананімную памяць. Гэта пагаршае чытальнасць часопіса, але дазваляе абыйсці некаторыя састарэлыя механізмы выяўлення.',
        zn_linker: 'Выкарыстоўваць лінкер Zygisk Next',
        zn_linker_desc: 'Выкарыстоўваць убудаваны кампаноўнік замест сістэмнага для загрузкі модуляў. Гэта павысіць утоенасць, але можа выклікаць праблемы сумяшчальнасці.',
    },
    zygote_inject_state: {
        running: 'Запушчаны',
        stop_by_user: 'Спынены карыстальнікам',
        stop_by_crash: 'Спынены памылкай zygote',
        running_desc: 'Маніторынг Zygote працуе нармальна.',
        stop_by_user_desc: 'Маніторынг Zygote спынены карыстальнікам.',
        stop_by_crash_desc: 'Выяўлены паўторныя перазапускі Zygote, маніторынг Zygote аўтаматычна спынены.',
    },
    zygote_state: {
        unknown: 'Невядомы',
        injected: 'Убудавана ({pid})',
        inject_failed: 'Памылка ўбудавання ({pid})',
        skipped: 'Прапушчана ({pid})',
        unknown_desc: 'Статус гэтага Zygote невядомы і можа працаваць, але не быць запушчаны ці маніторынг Zygote не можа выявіць яго запуск.',
        injected_desc: 'Zygisk быў укаранёны ў Zygote. Ідэнтыфікатар яго працэсу: {pid}',
        inject_failed_desc: 'Спроба ўкараніць Zygisk у Zygote не ўдалася. Ідэнтыфікатар працэсу: {pid}',
        skipped_desc: 'Zygote быў адсочаны да пачатку працы. Ідэнтыфікатар працэсу: {pid}. Укараненне Zygisk было спынена з-за шматлікіх перазагрузак сістэмы.'
    },
    corrupted: {
        title: 'Файлы модуля пашкоджаны',
        desc: 'Калі ласка, вярніце Zygisk Next да пачатковых налад і паспрабуйце яшчэ раз.',
    },
    module: {
        issue: {
            title: 'Гэты модуль мае праблему',
            companion_api_issue: 'Гэты модуль {name} мае праблему з няправільным выкарыстаннем Companion API, што можа прывесці да збояў працэсу і ўцечка памяці. Калі ласка, звярніцеся да распрацоўніка гэтага модуля для вырашэння спроб',
            linker_issue: 'Модуль {name} не ўдалося загрузіць. Паведаміце аб праблеме распрацоўніку модуля.',
            learn_more: 'Наведайце тут для атрымання дадатковай інфармацыі：{link}',
            check_banner: 'Праблемныя модулі не выяўлены. | Выяўлены праблемны модуль: {0}. Праверце спіс модуляў. | Выяўлена праблемных модуляў: {0}. Праверце спіс модуляў.',
            badge: 'Праблема',
        },
        zn: {
            process_count: 'Няма працэсаў | {0} працэс | {0} працэсаў',
        },
    },
}