export default {
    language: { 
        name: 'Українська (UA)'
    },
    main_fragment: {
        dashboard: 'Панель керування',
        basic: 'Основна інформація',
        settings: 'Налаштування'
    },
    dashboard: {
        root_impl: 'Джерело рут-прав',
        zygote_monitor: 'Моніторинг Zygote',
        modules: 'Немає модулів | Модуль (1) | Модулі ({0})',
        root_impl_normal: 'Поточне джерело рут-прав — {impl}, список виключень працюватиме коректно.',
        root_impl_abnormal: 'Не вдалося визначити джерело рут-прав, список виключень не працюватиме.',
        root_impl_multiple: 'Виявлено кілька джерел рут-прав, список виключень не працюватиме.',
        kernelsu_denylist: 'Denylist у KernelSU застосовується до застосунків, для яких увімкнено опцію «Розмонтувати модулі» в App Profile.',
        magisk_denylist: 'Denylist у Magisk застосовується до вбудованого списку виключень Magisk.',
        apatch_denylist: 'Denylist у APatch застосовується до застосунків, які позначені на вкладці SuperUser опцією «Виключити».',
    },
    settings: {
        log_to_kernel: 'Логування в dmesg (тільки для розробників)',
        enforce_denylist: 'Політика списку виключень (Denylist)',
        enforce_denylist_desc: 'Примусово: будь-які зміни для застосунків зі списку виключень будуть скасовані.<br/>Тільки розмонтування: будуть скасовані лише зміни модулів для застосунків зі списку виключень.',
        denylist_disabled: 'Вимкнено',
        denylist_enforced: 'Примусово',
        denylist_just_umount: 'Тільки розмонтування',
        anonymous_memory: 'Використовувати анонімну пам’ять',
        anonymous_memory_desc: 'Завантаження модулів в анонімну пам’ять. Це погіршує читабельність журналу, але допомагає обійти деякі застарілі механізми виявлення.',
        zn_linker: 'Використовувати лінкер Zygisk Next (експериментально)',
        zn_linker_desc: 'Використовувати вбудований компонувальник замість системного для завантаження модулів. Це підвищить прихованість, але може спричинити проблеми сумісності.',
    },
    zygote_inject_state: {
        running: 'Запущено',
        stop_by_user: 'Зупинено користувачем',
        stop_by_crash: 'Зупинено через помилку zygote',
        running_desc: 'Моніторинг Zygote працює нормально.',
        stop_by_user_desc: 'Моніторинг Zygote зупинено користувачем.',
        stop_by_crash_desc: 'Виявлено повторні перезапуски Zygote, моніторинг Zygote автоматично зупинено.',
    },
    zygote_state: {
        unknown: 'Невідомо',
        injected: 'Впроваджено ({pid})',
        inject_failed: 'Помилка впровадження ({pid})',
        skipped: 'Пропущено ({pid})',
        unknown_desc: 'Статус цього Zygote невідомий. Він може працювати, але моніторинг Zygote не може виявити його запуск.',
        injected_desc: 'Zygisk було успішно впроваджено в Zygote. Ідентифікатор процесу: {pid}',
        inject_failed_desc: 'Спроба впровадити Zygisk у Zygote не вдалася. Ідентифікатор процесу: {pid}',
        skipped_desc: 'Zygote було відстежено до початку роботи. Ідентифікатор процесу: {pid}. Впровадження Zygisk було зупинено через численні перезавантаження системи.'
    },
    corrupted: {
        title: 'Файли модуля пошкоджено',
        desc: 'Будь ласка, скиньте Zygisk Next до початкових налаштувань і спробуйте знову.'
    }
}